In [3]:
import pandas as pd
import numpy as np

### Task 1: Merge 12 months of sales into a single file

In [11]:
months = ['January', 'February', 'March', 'April', 'May', 'June', 'July', 'August', 'September', 'October', 'November', 'December']
sales_list = []

for m in months:
    sales_list.append(pd.read_csv('Sales_' + m + '_2019.csv'))

sales = pd.concat(sales_list, keys=months)
sales.head()

          Order ID                   Product Quantity Ordered Price Each  \
January 0   141234                    iPhone                1        700
        1   141235  Lightning Charging Cable                1      14.95
        2   141236          Wired Headphones                2      11.99
        3   141237          27in FHD Monitor                1     149.99
        4   141238          Wired Headphones                1      11.99

               Order Date                       Purchase Address
January 0  01/22/19 21:25        944 Walnut St, Boston, MA 02215
        1  01/28/19 14:15       185 Maple St, Portland, OR 97035
        2  01/17/19 13:33  538 Adams St, San Francisco, CA 94016
        3  01/05/19 20:33     738 10th St, Los Angeles, CA 90001
        4  01/25/19 11:59          387 10th St, Austin, TX 73301

### Task 2: Add a Month column

In [12]:
if not 'Month' in sales.columns:
    sales.insert(4, 'Month', 0)

for m,i in zip(months, range(1,13)):
    sales.loc[m, 'Month'] = i

sales.loc['November'].head()

,Order ID,Product,Quantity Ordered,Price Each,Month,Order Date,Purchase Address
0,278797,Wired Headphones,1,11.99,11,11/21/19 09:54,"46 Park St, New York City, NY 10001"
1,278798,USB-C Charging Cable,2,11.95,11,11/17/19 10:03,"962 Hickory St, Austin, TX 73301"
2,278799,Apple Airpods Headphones,1,150.0,11,11/19/19 14:56,"464 Cherry St, Los Angeles, CA 90001"
3,278800,27in FHD Monitor,1,149.99,11,11/25/19 22:24,"649 10th St, Seattle, WA 98101"
4,278801,Bose SoundSport Headphones,1,99.99,11,11/09/19 13:56,"522 Hill St, Boston, MA 02215"

## Data Cleaning

### Task 3: Find NaN rows

In [13]:
#sales_null = sales[sales.isnull().any(axis=1)]

sales = sales.dropna()
sales.loc['April'].head()

,Order ID,Product,Quantity Ordered,Price Each,Month,Order Date,Purchase Address
0,176558,USB-C Charging Cable,2,11.95,4,04/19/19 08:46,"917 1st St, Dallas, TX 75001"
2,176559,Bose SoundSport Headphones,1,99.99,4,04/07/19 22:30,"682 Chestnut St, Boston, MA 02215"
3,176560,Google Phone,1,600,4,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"
4,176560,Wired Headphones,1,11.99,4,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"
5,176561,Wired Headphones,1,11.99,4,04/30/19 09:27,"333 8th St, Los Angeles, CA 90001"

### Task 4: Convert values of 'Price Each' and 'Quantity Ordered' to numerical

In [14]:
#sales_invalid_price = sales['Price Each'].apply(lambda x: not isinstance(x,(int,float)))
#sales_invalid_price.head()

sales = sales.loc[sales['Price Each'] != 'Price Each']
sales['Price Each'] = sales['Price Each'].astype(float)
sales['Quantity Ordered'] = sales['Quantity Ordered'].astype(int)
sales.head()

          Order ID                   Product  Quantity Ordered  Price Each  \
January 0   141234                    iPhone                 1      700.00
        1   141235  Lightning Charging Cable                 1       14.95
        2   141236          Wired Headphones                 2       11.99
        3   141237          27in FHD Monitor                 1      149.99
        4   141238          Wired Headphones                 1       11.99

           Month      Order Date                       Purchase Address
January 0      1  01/22/19 21:25        944 Walnut St, Boston, MA 02215
        1      1  01/28/19 14:15       185 Maple St, Portland, OR 97035
        2      1  01/17/19 13:33  538 Adams St, San Francisco, CA 94016
        3      1  01/05/19 20:33     738 10th St, Los Angeles, CA 90001
        4      1  01/25/19 11:59          387 10th St, Austin, TX 73301

### Task 5: Add a 'Order Total' column

In [19]:
if not 'Order Total' in sales.columns:
    sales.insert(4, 'Order Total', 0)

sales['Order Total'] = sales[['Quantity Ordered', 'Price Each']].product(axis=1)
sales.head()

          Order ID                   Product  Quantity Ordered  Price Each  \
January 0   141234                    iPhone                 1      700.00
        1   141235  Lightning Charging Cable                 1       14.95
        2   141236          Wired Headphones                 2       11.99
        3   141237          27in FHD Monitor                 1      149.99
        4   141238          Wired Headphones                 1       11.99

           Order Total  Month      Order Date  \
January 0       700.00      1  01/22/19 21:25
        1        14.95      1  01/28/19 14:15
        2        23.98      1  01/17/19 13:33
        3       149.99      1  01/05/19 20:33
        4        11.99      1  01/25/19 11:59

                                Purchase Address
January 0        944 Walnut St, Boston, MA 02215
        1       185 Maple St, Portland, OR 97035
        2  538 Adams St, San Francisco, CA 94016
        3     738 10th St, Los Angeles, CA 90001
        4          387 10th St, Austin, TX 73301

### Question 1: What was the best month for sales? How much was earned that month?